Revit 2027 API
BuiltInFailures.HvacFailures Class
 Failures related to HVAC in MEP.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.HvacFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class HvacFailures
Public NotInheritable Class HvacFailures
public ref class HvacFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HvacFailures = class end
The BuiltInFailures.HvacFailures type exposes the following members.
Properties
Name | Description
PanelDoesntMatchCircuitPropertiesDisconnected |  The panel no longer matches the properties for the Circuit. Disconnect the panel from the Circuit?
Top
See Also
Reference
Autodesk.Revit.DB Namespace